{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Пак задач 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n",
    "- В начале заседания никаких законопроектов на повестке дня не стоит.\n",
    "- Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n",
    "- При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n",
    "- Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n",
    "- В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n",
    "\n",
    "Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше.\n",
    "\n",
    "Входные данные:\n",
    "\n",
    "Первая строка входных данных содержит одно целое число K – количество строк в записи сессии (1 ≤ K ≤ 1000). Каждая строка соответствует одному из двух событий:\n",
    "Add x – партия x внесла на голосование законопроект.\n",
    "Vote x – прошло голосование за документ, внесённый партией x.\n",
    "Здесь x – строчная буква английского алфавита от «a» до «z», задающая партию.\n",
    "\n",
    "Вывод:\n",
    "\n",
    "Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No\n"
     ]
    }
   ],
   "source": [
    "# узнаем размер массива строк и заполняем его\n",
    "countOfLines = int(input(\"Размер массива строк: \"))\n",
    "arr = []\n",
    "for i in range(countOfLines):\n",
    "    arr.append(input())\n",
    "    \n",
    "# проверяем массив на соблюдение всех условий\n",
    "if arr[0].find('vote') == -1:\n",
    "    nothingToDelete = False\n",
    "    while len(arr) > 0 and not nothingToDelete:\n",
    "        letter = ''\n",
    "        addPos = -1\n",
    "        votePos = -1\n",
    "\n",
    "        for i in range(len(arr)):\n",
    "            if arr[i].find('add') != -1:\n",
    "                addPos = i\n",
    "                letter = arr[i][4]\n",
    "            elif arr[i].find(letter) != -1:\n",
    "\n",
    "                votePos = i\n",
    "                break\n",
    "            else:\n",
    "                nothingToDelete = True\n",
    "                \n",
    "        #print(\"Проход по массиву закончен Партия {0}, Позиция Add {1}, Позиция Vote {2}, nothingToDelete {3}.\".format(letter, addPos, votePos, nothingToDelete))\n",
    "\n",
    "        if addPos != -1 and votePos != -1 and not nothingToDelete:\n",
    "            arr.pop(addPos)\n",
    "            arr.pop(votePos - 1)\n",
    "        else:\n",
    "\n",
    "            nothingToDelete = True\n",
    "\n",
    "    if len(arr) == 0:\n",
    "        print('Yes')\n",
    "    else:\n",
    "        print('No')\n",
    "else:\n",
    "\n",
    "    print('No')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задан правильный N-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n",
    "\n",
    "Входные данные:\n",
    "\n",
    "Входные данные содержат одно целое число N (3 ≤ N ≤ 1012).\n",
    " \n",
    "Вывод:\n",
    "\n",
    "Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "arr = [x for x in range(3,1012 + 1) if n % x == 0]\n",
    "print(arr[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из N десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления B, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его D), а также число X, большее 1 и меньшее D, являющееся делителем D.\n",
    "При этом B и X не должны превосходить 109.\n",
    "По заданной строке десятичных цифр найдите любую пару чисел B и X, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n",
    "\n",
    "Входные данные:\n",
    "\n",
    "Входные данные состоят из непустой строки длиной до 3 ⋅ 106 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n",
    "\n",
    "Вывод:\n",
    "\n",
    "Если решение существует, выведите два числа – основание системы счисления B и делитель X, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ B, X ≤ 109. Если решения не существует, выведите –1.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "inp = input()\n",
    "ans = []\n",
    "for i in range(2,37):\n",
    "    try:\n",
    "        for k in range(2,int(inp, i)):\n",
    "            if (int(inp, i) % k == 0):\n",
    "                ans.append(\"{0} {1}\".format(i,k))\n",
    "    except Exception:\n",
    "        err = 1\n",
    "            \n",
    "if (not ans):\n",
    "    ans.append(-1)\n",
    "    \n",
    "print(ans)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "metadata": {
   "interpreter": {
    "hash": "e159defb5f97972724bdefb208d7312f9d46c34261680fb17c6a0687d836281c"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
